Use the function c() to create a numeric vector with the average high temperatures in January for Beijing, Lagos, Paris, Rio de Janeiro, San Juan, and Toronto. The average high temperatures are 35, 88, 42, 84, 81, and 30 degrees Fahrenheit. Call the object temp

In [1]:
import pandas as pd
import numpy as np

In [2]:
countries = ['Beijing', 'Lagos', 'Paris', 'Rio de Janeiro', 'San Juan', 'Toronto']

In [3]:
fah = np.array([35, 88, 42, 84, 81, 30])

In [4]:
temp = pd.DataFrame(data=fah, index=countries, columns=['F'])

In [5]:
temp

                 F
Beijing         35
Lagos           88
Paris           42
Rio de Janeiro  84
San Juan        81
Toronto         30

Create a vector with these city names and call the object city. Make sure to use the correct order, spelling and capitalization!

Use the names function and the objects defined in the previous exercises to associate the temperature data with its corresponding city. (You can go back to the previous questions and copy the objects stored.) Note: to see what happened, after assigning the city names to the temp vector, try printing the temp vector to understand how the names are associated with elements of temp.

Use the [ and : operators to access the temperature of the first three cities in the list, which are already stored in temp

This time we will access our object using just the [ operator. Use the [ operator to access the temperature of Paris and San Juan already stored in the temp object.

This time we will use just the : operator. Use the : operator to create a sequence of consecutive integers starting at 12 and ending at 73 and save it in an object x, then determine the length of object x

In [6]:
x = range(12,74)

In [7]:
x

range(12, 74)

In [8]:
len(x)

62

Create a vector containing all the positive odd numbers smaller than 100. The numbers should be in ascending order.

Create a vector of numbers that starts at 6, does not go beyond 55, and adds numbers in increments of 4/7. So the first three numbers will be 6, 6+4/7, and 6+8/7. How many numbers does the list have? Use only one line of code to answer both questions.

Determine the class of a vector generated with seq using the length.out argument.
Specifically, what is the class of the following object a <- seq(1, 10, length.out = 100)?

Does this change depending on what we store in an object? What is the class of the following object a <- seq(1, 10)?

Confirm that the class of 1 is numeric and the class of 1L is integer.

Convert x to a vector of numbers using the as.numeric() function.

Use the $ operator to access the population size data and store it in the object pop.

Then use the sort function to redefine pop so that it is sorted.

Finally use the [ operator to report the smallest population size.

In [9]:
df = pd.read_csv("murders.csv")
df.head()

        state abb region  population  total
0     Alabama  AL  South     4779736    135
1      Alaska  AK   West      710231     19
2     Arizona  AZ   West     6392017    232
3    Arkansas  AR  South     2915918     93
4  California  CA   West    37253956   1257

In [10]:
pop = df.population

In [11]:
pop = df.population.sort_values()

In [12]:
pop.min()

563626

Now instead of the smallest population size, let's find out the row number, in the data frame murders, of the state with the smallest population size.

This time we need to use order() instead of sort().

Remember that the entries in the vector murders$population follow the order of the rows of murders.

In [13]:
state = df[["state","population"]]

In [14]:
state.sort_values(by="population").head()

                   state  population
50               Wyoming      563626
8   District of Columbia      601723
45               Vermont      625741
34          North Dakota      672591
1                 Alaska      710231

Write one line of code that gives the index of the lowest population entry. Use the which.min command.

In [15]:
state.loc[state.population == 563626]

      state  population
50  Wyoming      563626

Combine these to find the state name for the smallest state.

Create a data frame with state names and their respective ranks. Call the data frame my_df

Create a data frame with both variables following the correct order. Use the bracket operator [ to re-order each column in the data frame.

Determine how many NAs na_example has, using the sum command.

Write one line of code to compute the average, but only for the entries that are not NA making use of the ! operator before ind.

Create a data frame called city_temps with the city names and temperatures in Celsius.

In [16]:
temp

                 F
Beijing         35
Lagos           88
Paris           42
Rio de Janeiro  84
San Juan        81
Toronto         30

In [17]:
temp["C"] = (5/9) * (temp.F - 32)

In [18]:
temp

                 F          C
Beijing         35   1.666667
Lagos           88  31.111111
Paris           42   5.555556
Rio de Janeiro  84  28.888889
San Juan        81  27.222222
Toronto         30  -1.111111

In [19]:
city_temps = temp.copy()

In [20]:
city_temps

                 F          C
Beijing         35   1.666667
Lagos           88  31.111111
Paris           42   5.555556
Rio de Janeiro  84  28.888889
San Juan        81  27.222222
Toronto         30  -1.111111

Compute the sum 1 + 1/2^2 + 1/3^2 + ... + 1/100^2

compute the average of the state murder rates for the US using the function mean. What is this average?

### Section 2 Assessment

In [21]:
names = ["Mandi", "Amy", "Nicole", "Olivia"]

In [22]:
dist = np.array([0.8, 3.1, 2.8, 4.0])

In [23]:
time = np.array([10, 30, 40, 50])

In [24]:
run = pd.DataFrame(data=dist, index=names, columns=['Distance'])

In [25]:
run

        Distance
Mandi        0.8
Amy          3.1
Nicole       2.8
Olivia       4.0

In [26]:
run["Time"] = time

In [27]:
run

        Distance  Time
Mandi        0.8    10
Amy          3.1    30
Nicole       2.8    40
Olivia       4.0    50

Write a line of code to convert time to hours. Remember there are 60 minutes in an hour. Then write a line of code to calculate the speed of each runner in miles per hour. Speed is distance divided by time.

In [28]:
run["Hours"] = run["Time"] / 60

In [29]:
run

        Distance  Time     Hours
Mandi        0.8    10  0.166667
Amy          3.1    30  0.500000
Nicole       2.8    40  0.666667
Olivia       4.0    50  0.833333

In [30]:
run["Speed"] = run["Distance"] / run["Hours"]

In [31]:
run

        Distance  Time     Hours  Speed
Mandi        0.8    10  0.166667    4.8
Amy          3.1    30  0.500000    6.2
Nicole       2.8    40  0.666667    4.2
Olivia       4.0    50  0.833333    4.8